### Terraform `plan` Succeeded for Workspace: `dev`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # kubernetes_storage_class_v1.efs[0] will be created
+   resource "kubernetes_storage_class_v1" "efs" {
+       allow_volume_expansion = true
+       id                     = (known after apply)
+       parameters             = {
+           "directoryPerms" = "700"
+           "fileSystemId"   = "fs-021a87c350b83a340"
+           "type"           = "efs-ap"
        }
+       reclaim_policy         = "Retain"
+       storage_provisioner    = "efs.csi.aws.com"
+       volume_binding_mode    = "Immediate"

+       metadata {
+           generation       = (known after apply)
+           name             = "jingood2-dev-efs"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.efs.aws_efs_mount_target.this["subnet-0295d3a037cfc7c23"] will be created
+   resource "aws_efs_mount_target" "this" {
+       availability_zone_id   = (known after apply)
+       availability_zone_name = (known after apply)
+       dns_name               = (known after apply)
+       file_system_arn        = (known after apply)
+       file_system_id         = "fs-021a87c350b83a340"
+       id                     = (known after apply)
+       ip_address             = (known after apply)
+       mount_target_dns_name  = (known after apply)
+       network_interface_id   = (known after apply)
+       owner_id               = (known after apply)
+       security_groups        = (known after apply)
+       subnet_id              = "subnet-0295d3a037cfc7c23"
    }

  # module.efs.aws_efs_mount_target.this["subnet-0d102e9e62c553f9a"] will be created
+   resource "aws_efs_mount_target" "this" {
+       availability_zone_id   = (known after apply)
+       availability_zone_name = (known after apply)
+       dns_name               = (known after apply)
+       file_system_arn        = (known after apply)
+       file_system_id         = "fs-021a87c350b83a340"
+       id                     = (known after apply)
+       ip_address             = (known after apply)
+       mount_target_dns_name  = (known after apply)
+       network_interface_id   = (known after apply)
+       owner_id               = (known after apply)
+       security_groups        = (known after apply)
+       subnet_id              = "subnet-0d102e9e62c553f9a"
    }

  # module.efs.aws_security_group.this[0] will be created
+   resource "aws_security_group" "this" {
+       arn                    = (known after apply)
+       description            = "jingood2-dev EFS security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = "jingood2-dev-efs-sg"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = true
+       tags                   = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all               = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       vpc_id                 = "vpc-001360522b20e3855"
    }

  # module.efs.aws_security_group_rule.this["vpc"] will be created
+   resource "aws_security_group_rule" "this" {
+       cidr_blocks              = [
+           "10.0.11.0/24",
+           "10.0.10.0/24",
        ]
+       description              = "EFS ingress from VPC private subnets"
+       from_port                = 2049
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 2049
+       type                     = "ingress"
    }

  # module.eks_blueprints.kubernetes_config_map.aws_auth[0] will be created
+   resource "kubernetes_config_map" "aws_auth" {
+       data = {
+           "mapAccounts" = jsonencode([])
+           "mapRoles"    = <<-EOT
-                 "groups":
-                   "system:bootstrappers"
-                   "system:nodes"
                  "rolearn": "arn:aws:iam::484752921218:role/jingood2-dev-eks-general"
                  "username": "system:node:{{EC2PrivateDNSName}}"
-                 "groups":
-                   "system:masters"
                  "rolearn": "arn:aws:iam::484752921218:role/jingood2-dev-eks-admin-access"
                  "username": "admin"
-                 "groups":
-                   "system:masters"
                  "rolearn": "arn:aws:iam::484752921218:role/eks-admin-role"
                  "username": "eks-admin-role"
            EOT
+           "mapUsers"    = jsonencode([])
        }
+       id   = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/created-by" = "terraform-aws-eks-blueprints"
+               "app.kubernetes.io/managed-by" = "terraform-aws-eks-blueprints"
            }
+           name             = "aws-auth"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.eks_blueprints.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["environment"] will be created
+   resource "aws_ec2_tag" "cluster_primary_security_group" {
+       id          = (known after apply)
+       key         = "environment"
+       resource_id = "sg-05b91b83983d151f5"
+       value       = "dev"
    }

  # module.eks_blueprints.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["owners"] will be created
+   resource "aws_ec2_tag" "cluster_primary_security_group" {
+       id          = (known after apply)
+       key         = "owners"
+       resource_id = "sg-05b91b83983d151f5"
+       value       = "jingood2"
    }

  # module.eks_blueprints.module.aws_eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
+   resource "aws_iam_openid_connect_provider" "oidc_provider" {
+       arn             = (known after apply)
+       client_id_list  = [
+           "sts.amazonaws.com",
        ]
+       id              = (known after apply)
+       tags            = {
+           "Name"        = "jingood2-dev-eks-eks-irsa"
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all        = {
+           "Name"        = "jingood2-dev-eks-eks-irsa"
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       thumbprint_list = [
+           "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ]
+       url             = "https://oidc.eks.us-east-1.amazonaws.com/id/9B9F258FF0D2A43BB59D39B1533E1673"
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].data.aws_iam_policy_document.managed_ng_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "managed_ng_assume_role_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           sid     = "EKSWorkerAssumeRole"

+           principals {
+               identifiers = [
+                   "ec2.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_eks_node_group.managed_ng will be created
+   resource "aws_eks_node_group" "managed_ng" {
+       ami_type               = "AL2_x86_64"
+       arn                    = (known after apply)
+       capacity_type          = "SPOT"
+       cluster_name           = "jingood2-dev-eks"
+       disk_size              = 50
+       id                     = (known after apply)
+       instance_types         = [
+           "t3a.large",
        ]
+       node_group_name        = (known after apply)
+       node_group_name_prefix = "general-"
+       node_role_arn          = (known after apply)
+       release_version        = (known after apply)
+       resources              = (known after apply)
+       status                 = (known after apply)
+       subnet_ids             = [
+           "subnet-0295d3a037cfc7c23",
+           "subnet-0d102e9e62c553f9a",
        ]
+       tags                   = {
+           "Name"                                       = "jingood2-dev-eks-general"
+           "environment"                                = "dev"
+           "k8s.io/cluster-autoscaler/enabled"          = "TRUE"
+           "k8s.io/cluster-autoscaler/jingood2-dev-eks" = "owned"
+           "kubernetes.io/cluster/jingood2-dev-eks"     = "owned"
+           "managed-by"                                 = "terraform-aws-eks-blueprints"
+           "owners"                                     = "jingood2"
        }
+       tags_all               = {
+           "Name"                                       = "jingood2-dev-eks-general"
+           "environment"                                = "dev"
+           "k8s.io/cluster-autoscaler/enabled"          = "TRUE"
+           "k8s.io/cluster-autoscaler/jingood2-dev-eks" = "owned"
+           "kubernetes.io/cluster/jingood2-dev-eks"     = "owned"
+           "managed-by"                                 = "terraform-aws-eks-blueprints"
+           "owners"                                     = "jingood2"
        }
+       version                = "1.25"

+       scaling_config {
+           desired_size = 1
+           max_size     = 2
+           min_size     = 1
        }

+       timeouts {
+           create = "30m"
+           delete = "30m"
+           update = "2h"
        }

+       update_config {
+           max_unavailable = 1
        }
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_iam_instance_profile.managed_ng[0] will be created
+   resource "aws_iam_instance_profile" "managed_ng" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = "jingood2-dev-eks-general"
+       name_prefix = (known after apply)
+       path        = "/"
+       role        = "jingood2-dev-eks-general"
+       tags        = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all    = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       unique_id   = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_iam_role.managed_ng[0] will be created
+   resource "aws_iam_role" "managed_ng" {
+       arn                   = (known after apply)
+       assume_role_policy    = (known after apply)
+       create_date           = (known after apply)
+       description           = "EKS Managed Node group IAM Role"
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "jingood2-dev-eks-general"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all              = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       unique_id             = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_iam_role_policy_attachment.managed_ng["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
+   resource "aws_iam_role_policy_attachment" "managed_ng" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+       role       = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_iam_role_policy_attachment.managed_ng["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
+   resource "aws_iam_role_policy_attachment" "managed_ng" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
+       role       = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_iam_role_policy_attachment.managed_ng["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
+   resource "aws_iam_role_policy_attachment" "managed_ng" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
+       role       = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_iam_role_policy_attachment.managed_ng["arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"] will be created
+   resource "aws_iam_role_policy_attachment" "managed_ng" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
+       role       = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks_teams[0].aws_iam_policy.platform_team_eks_access[0] will be created
+   resource "aws_iam_policy" "platform_team_eks_access" {
+       arn         = (known after apply)
+       description = "Platform Team EKS Console Access"
+       id          = (known after apply)
+       name        = "jingood2-dev-eks-PlatformTeamEKSAccess"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ssm:GetParameter",
+                           "eks:ListUpdates",
+                           "eks:ListNodegroups",
+                           "eks:ListFargateProfiles",
+                           "eks:ListClusters",
+                           "eks:DescribeNodegroup",
+                           "eks:DescribeCluster",
+                           "eks:AccessKubernetesApi",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:eks:us-east-1:484752921218:cluster/jingood2-dev-eks"
+                       Sid      = "AllowPlatformTeamEKSAccess"
                    },
+                   {
+                       Action   = "eks:ListClusters"
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "AllowListClusters"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags        = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all    = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
    }

  # module.eks_blueprints.module.aws_eks_teams[0].aws_iam_role.platform_team["admin"] will be created
+   resource "aws_iam_role" "platform_team" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = [
+                               "arn:aws:iam::484752921218:user/jingood2@sk.com",
                            ]
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "jingood2-dev-eks-admin-access"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all              = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       unique_id             = (known after apply)
    }

  # module.eks_blueprints.module.kms[0].aws_kms_alias.this will be created
+   resource "aws_kms_alias" "this" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       name           = "alias/jingood2-dev-eks"
+       name_prefix    = (known after apply)
+       target_key_arn = (known after apply)
+       target_key_id  = "c3f0743f-9877-414a-ab9d-4513e2b612a2"
    }

  # module.kubernetes_addons.module.argocd[0].helm_release.argocd_application["addons"] will be created
+   resource "helm_release" "argocd_application" {
+       atomic                     = false
+       chart                      = ".terraform/modules/kubernetes_addons/modules/kubernetes-addons/argocd/argocd-application/helm"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "addons"
+       namespace                  = "argocd"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                "ignoreDifferences": []
            EOT,
        ]
+       verify                     = false
+       version                    = "0.1.0"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "destination.server"
+           type  = "string"
+           value = "https://kubernetes.default.svc"
        }
+       set {
+           name  = "name"
+           type  = "string"
+           value = "addons"
        }
+       set {
+           name  = "project"
+           type  = "string"
+           value = "default"
        }
+       set {
+           name  = "source.helm.releaseName"
+           type  = "string"
+           value = "addons"
        }
+       set {
+           name  = "source.helm.values"
+           type  = "auto"
+           value = <<-EOT
                "account": "484752921218"
                "clusterName": "jingood2-dev-eks"
                "region": "us-east-1"
                "repoUrl": "https://github.com/aws-samples/eks-blueprints-add-ons.git"
            EOT
        }
+       set {
+           name  = "source.path"
+           type  = "string"
+           value = "chart"
        }
+       set {
+           name  = "source.repoUrl"
+           type  = "string"
+           value = "https://github.com/aws-samples/eks-blueprints-add-ons.git"
        }
+       set {
+           name  = "source.targetRevision"
+           type  = "string"
+           value = "HEAD"
        }
    }

  # module.kubernetes_addons.module.aws_ebs_csi_driver[0].aws_eks_addon.aws_ebs_csi_driver[0] will be created
+   resource "aws_eks_addon" "aws_ebs_csi_driver" {
+       addon_name               = "aws-ebs-csi-driver"
+       addon_version            = "v1.17.0-eksbuild.1"
+       arn                      = (known after apply)
+       cluster_name             = "jingood2-dev-eks"
+       configuration_values     = (known after apply)
+       created_at               = (known after apply)
+       id                       = (known after apply)
+       modified_at              = (known after apply)
+       preserve                 = true
+       resolve_conflicts        = "OVERWRITE"
+       service_account_role_arn = (known after apply)
+       tags_all                 = (known after apply)
    }

  # module.kubernetes_addons.module.aws_ebs_csi_driver[0].aws_iam_policy.aws_ebs_csi_driver[0] will be created
+   resource "aws_iam_policy" "aws_ebs_csi_driver" {
+       arn         = (known after apply)
+       description = "IAM Policy for AWS EBS CSI Driver"
+       id          = (known after apply)
+       name        = "jingood2-dev-eks-aws-ebs-csi-driver-irsa"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ec2:ModifyVolume",
+                           "ec2:DetachVolume",
+                           "ec2:DescribeVolumesModifications",
+                           "ec2:DescribeVolumes",
+                           "ec2:DescribeTags",
+                           "ec2:DescribeSnapshots",
+                           "ec2:DescribeInstances",
+                           "ec2:DescribeAvailabilityZones",
+                           "ec2:CreateSnapshot",
+                           "ec2:AttachVolume",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = ""
                    },
+                   {
+                       Action    = "ec2:CreateTags"
+                       Condition = {
+                           StringEquals = {
+                               "ec2:CreateAction" = [
+                                   "CreateVolume",
+                                   "CreateSnapshot",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:ec2:*:*:volume/*",
+                           "arn:aws:ec2:*:*:snapshot/*",
                        ]
+                       Sid       = ""
                    },
+                   {
+                       Action   = "ec2:DeleteTags"
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:ec2:*:*:volume/*",
+                           "arn:aws:ec2:*:*:snapshot/*",
                        ]
+                       Sid      = ""
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/CSIVolumeName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/CSIVolumeName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteSnapshot"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteSnapshot"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.kubernetes_addons.module.aws_ebs_csi_driver[0].module.irsa_addon[0].aws_iam_role.irsa[0] will be created
+   resource "aws_iam_role" "irsa" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringLike = {
+                               "oidc.eks.us-east-1.amazonaws.com/id/9B9F258FF0D2A43BB59D39B1533E1673:aud" = "sts.amazonaws.com"
+                               "oidc.eks.us-east-1.amazonaws.com/id/9B9F258FF0D2A43BB59D39B1533E1673:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::484752921218:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/9B9F258FF0D2A43BB59D39B1533E1673"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       description           = "AWS IAM Role for the Kubernetes service account ebs-csi-controller-sa."
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "jingood2-dev-eks-ebs-csi-controller-sa-irsa"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # module.kubernetes_addons.module.aws_ebs_csi_driver[0].module.irsa_addon[0].aws_iam_role_policy_attachment.irsa[0] will be created
+   resource "aws_iam_role_policy_attachment" "irsa" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "jingood2-dev-eks-ebs-csi-controller-sa-irsa"
    }

Plan: 24 to add, 0 to change, 0 to destroy.
```
</details>